/*
 * LinkedList
 * Представляет собой двусвязный список.
    Список – гибкая структура данных, позволяющая легко менять свой
    размер. Элементы доступны для вставки или удаления в любой позиции.
 * LinkedList нужен для небольшого количества
    элементов, в которых операции добавления\удаления
    встречаются чаще операций чтения.
 * PriorityQueue
 * Наивысший приоритет имеет «наименьший» элемент.
 * Deque
 * Линейная коллекция, которая поддерживает вставку и удаление
    элементов на обоих концах. 
 * Stack
 * Stack представляет собой обработку данных по принципу LIFO.
    Расширяет Vector пятью операциями, которые позволяют рассматривать
    вектор как стек.
    push(E item)
    pop()
 */

package Lecture_04;

public class Lecture4 {
    public static void main(String[] args) {
        
    }
}
